#!/bin/bash
DIALOG=${DIALOG=dialog}

$DIALOG --infobox "
================================================================ \n
       _______     ______   ______ _______ _____ __   _ \n
          |    ___ |_____] |_____/ |_____|   |   | \  | \n
          |        |_____] |    \_ |     | __|__ |  \_| \n
\n
================================================================ \n
\n
       Добро пожаловать в мастер установки Gentoo Linux! \n
" 10 70 ; sleep 5

$DIALOG --title "Настройка сети" --clear \
        --yesno "Хотели бы вы импортировать настройки сетевого адаптора LiveCD \n Если нет, вам придется ввести их вручную." 10 60


case $? in
    0)
        $DIALOG --title "Настройка сети" --clear \
        --yesno "Вы импортировали настройки сетевого адаптора LiveCD" 10 60;;
    1)
        $DIALOG --title "Настройка сети" --clear \
        --yesno "Простба ввести сетевые настройки" 10 60;;
    255)
        echo "Нажата клавиша ESC. Пользователь отменил установку";;
esac
