#!/bin/bash
DIALOG=${DIALOG=dialog}

$DIALOG --infobox "
================================================================ \n
\n
\n
                    ▀▀▀▀▀▀▀▀▀▀▌▐▀▀▀▀▀▀▀▀▀▀ \n
                    ▀▀▀▀▀▀▀▀▀▌▌▐▐▀▀▀▀▀▀▀▀▀ \n
                    ▀▀▀▀▀▀▀▀▌▌▌▐▐▐▀▀▀▀▀▀▀▀ \n
                    ▀▀▀▀▀▀▀▌▌▌▌▐▐▐▐▀▀▀▀▀▀▀ \n
                    ▀▀▀▀▀▀▌▌▌▌▌▐▐▐▐▐▀▀▀▀▀▀ \n
                    ▀▀▀▀▀▌▌▌▌▌▌▐▐▐▐▐▐▀▀▀▀▀ \n
                    ▄▄▄▄▄▌▌▌▌▌▌▐▐▐▐▐▐▄▄▄▄▄ \n
                    ▄▄▄▄▄▄▌▌▌▌▌▐▐▐▐▐▄▄▄▄▄▄ \n
                    ▄▄▄▄▄▄▄▌▌▌▌▐▐▐▐▄▄▄▄▄▄▄ \n
                    ▄▄▄▄▄▄▄▄▌▌▌▐▐▐▄▄▄▄▄▄▄▄ \n
                    ▄▄▄▄▄▄▄▄▄▌▌▐▐▄▄▄▄▄▄▄▄▄ \n
                    ▄▄▄▄▄▄▄▄▄▄▌▐▄▄▄▄▄▄▄▄▄▄ \n
\n
\n
       _______     ______   ______ _______ _____ __   _ \n
          |    ___ |_____] |_____/ |_____|   |   | \  | \n
          |        |_____] |    \_ |     | __|__ |  \_| \n
\n
================================================================ \n
\n
       Добро пожаловать в мастер установки Gentoo Linux! \n
" 30 70 ; sleep 8

$DIALOG --title "Настройка сети" --clear \
        --yesno "Хотели бы вы импортировать настройки сетевого адаптора LiveCD \n Если нет, вам придется ввести их вручную." 10 60


case $? in
    0)
        $DIALOG --title "Настройка сети" --clear \
        --yesno "Вы импортировали настройки сетевого адаптора LiveCD" 10 60;;
    1)
        $DIALOG --title "Настройка сети" --clear \
        --yesno "Простба ввести сетевые настройки" 10 60;;
    255)
        echo "Нажата клавиша ESC. Пользователь отменил установку";;
esac


dialog --checklist "Choose toppings:" 10 40 3 \
        1 Cheese on \
        2 "Tomato Sauce" on \
        3 Anchovies off
                                                                                                                                                                            1,3       Наверху
